<a href="https://colab.research.google.com/github/rakieciarz/ML_bootcamp_1/blob/main/l001e003.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import sklearn

Przygotowanie danych do uczenia maszynowego - ekstrakcja cech
- podział danych na kilka cech np. kolumna data na kolumny rok, miesiąc dzień
- kategoryzowanie danych liczbowych; dane ciągła na kategorie albo 0/1

In [6]:
def fetch_financial_data(company='AMZN'):
    import pandas_datareader.data as web
    return web.DataReader(name=company, data_source='stooq')

df_raw = fetch_financial_data()
df_raw.head()

               Open      High        Low    Close   Volume
Date
2021-03-25  3072.99  3109.780  3037.1400  3046.26  3563469
2021-03-24  3151.04  3160.310  3085.1500  3087.07  2958981
2021-03-23  3127.00  3182.000  3120.8501  3137.50  3817263
2021-03-22  3067.85  3126.580  3060.0500  3110.87  2902179
2021-03-19  3029.23  3077.285  3016.6300  3074.96  4625354

In [7]:
df = df_raw.copy()
df = df[:5]
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5 entries, 2021-03-25 to 2021-03-19
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Open    5 non-null      float64
 1   High    5 non-null      float64
 2   Low     5 non-null      float64
 3   Close   5 non-null      float64
 4   Volume  5 non-null      int64
dtypes: float64(4), int64(1)
memory usage: 240.0 bytes

In [8]:
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year
df

               Open      High        Low    Close   Volume  day  month  year
Date
2021-03-25  3072.99  3109.780  3037.1400  3046.26  3563469   25      3  2021
2021-03-24  3151.04  3160.310  3085.1500  3087.07  2958981   24      3  2021
2021-03-23  3127.00  3182.000  3120.8501  3137.50  3817263   23      3  2021
2021-03-22  3067.85  3126.580  3060.0500  3110.87  2902179   22      3  2021
2021-03-19  3029.23  3077.285  3016.6300  3074.96  4625354   19      3  2021

In [9]:
df = pd.DataFrame(data={'height': [175., 178.5, 185., 191., 184.5, 183., 168.]})
df

   height
0   175.0
1   178.5
2   185.0
3   191.0
4   184.5
5   183.0
6   168.0

In [13]:
df['height_cut'] = pd.cut(x=df.height,bins=(160,175,180,195),labels=['small','medium','height'])
df

   height height_cut
0   175.0      small
1   178.5     medium
2   185.0     height
3   191.0     height
4   184.5     height
5   183.0     height
6   168.0      small

In [16]:
pd.get_dummies(df['height_cut'], drop_first=True)

   medium  height
0       0       0
1       1       0
2       0       1
3       0       1
4       0       1
5       0       1
6       0       0

In [17]:
df = pd.DataFrame(data={'lang': [['PL', 'ENG'], ['GER', 'ENG', 'PL', 'FRA'], ['RUS']]})
df

                  lang
0            [PL, ENG]
1  [GER, ENG, PL, FRA]
2                [RUS]

In [20]:
df['lang_numb'] = df['lang'].apply(len)
df

                  lang  lang_numb
0            [PL, ENG]          2
1  [GER, ENG, PL, FRA]          4
2                [RUS]          1

In [21]:
df['PL_FLAG'] = df['lang'].apply(lambda lang: 1 if "PL" in lang else 0)
df

                  lang  lang_numb  PL_FLAG
0            [PL, ENG]          2        1
1  [GER, ENG, PL, FRA]          4        1
2                [RUS]          1        0

In [22]:
df = pd.DataFrame(data={'website': ['wp.pl', 'onet.pl', 'google.com']})
df

      website
0       wp.pl
1     onet.pl
2  google.com

In [30]:
new = df['website'].str.split(".", expand=True)
df['portal'] = new[0]
df['extension'] = new[1]
df

      website  portal extension
0       wp.pl      wp        pl
1     onet.pl    onet        pl
2  google.com  google       com